src/porefoam2f/script/base/constant/dynamicMeshDict
//----------------------------- -*- C++ -*- ---------------------------.
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
//----------------------------------------------------------------------

dynamicFvMesh   staticFvMesh;


//----------------------------------------------------------------------
