src/porefoam2f/script/base/system/surfaceFeatureExtractDict
//----------------------------- -*- C++ -*- ---------------------------.
FoamFile
{
    version		2.0;
    format		ascii;
    class  		dictionary;
	object  	surfaceFeatureExtractDict;
}
//----------------------------------------------------------------------
solidwalls.vtk 
{
	// How to obtain raw features (extractFromFile || extractFromSurface)
	extractionMethod extractFromSurface;
	extractFromSurfaceCoeffs
	{
		// Mark edges whose adjacent surface normals are at an angle less
		// than includedAngle as features
		// - 0 : selects no edges
		// - 180: selects all edges
		includedAngle 80;
		
        // Do not mark region edges
        geometricTestOnly       yes;
	}
	// Write options
	// Write features to obj format for postprocessing
	// writeObj yes;
}
